"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": null, \"filters\": \"\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": null, \"document_count\": 2658, \"word_counts\": \"{\\\"qnt\\\": 1391, \\\"cmn\\\": 11928, \\\"adp\\\": 337, \\\"com\\\": 6748, \\\"vft\\\": 6329, \\\"itv\\\": 1697, \\\"3psf\\\": 12355, \\\"fr\\\": 4284, \\\"trv\\\": 6114, \\\"in\\\": 9429, \\\"3ppg\\\": 6623, \\\"ppn\\\": 5358, \\\"pop\\\": 1983, \\\"coc\\\": 2974, \\\"sym\\\": 5339, \\\"co\\\": 2039, \\\"em\\\": 293, \\\".\\\": 2087, \\\"ad\\\": 3610, \\\"crc\\\": 328, \\\"dmp\\\": 1977, \\\"mod\\\": 325, \\\"add\\\": 680, \\\"neg\\\": 896, \\\"idp\\\": 429, \\\"on\\\": 53, \\\"suc\\\": 846, \\\"br\\\": 1228, \\\"spa\\\": 271, \\\"cn\\\": 971, \\\"colv\\\": 147, \\\"rfp\\\": 107, \\\"cav\\\": 1344, \\\"adj\\\": 1655, \\\"xx\\\": 24, \\\"abn\\\": 2572, \\\"3psm\\\": 3903, \\\"adt\\\": 871, \\\"vst\\\": 59, \\\"dtv\\\": 360, \\\"1ppg\\\": 838, \\\"cma\\\": 90, \\\"inp\\\": 181, \\\"clf\\\": 276, \\\"vpp\\\": 249, \\\"cln\\\": 284, \\\"pav\\\": 128, \\\"1psg\\\": 234, \\\"adf\\\": 8, \\\"mtn\\\": 116, \\\"vpt\\\": 1, \\\"2pg\\\": 36, \\\"3psg\\\": 183, \\\"rlp\\\": 10, \\\"im\\\": 15, \\\"2pm\\\": 3, \\\"2pf\\\": 1, \\\"adm\\\": 4, \\\"cmstn\\\": 1, \\\"tv\\\": 1, \\\"+423\\\": 1, \\\"1psm\\\": 1, \\\"ppn,\\\": 2, \\\"ppnka\\\": 1, \\\"fppnr\\\": 1}\", \"word_docs\": \"{\\\"pop\\\": 1312, \\\"sym\\\": 1895, \\\"ppn\\\": 1645, \\\"adp\\\": 285, \\\"in\\\": 2542, \\\"co\\\": 1357, \\\"em\\\": 266, \\\"qnt\\\": 912, \\\"fr\\\": 1271, \\\"3ppg\\\": 2012, \\\"cmn\\\": 2535, \\\"3psf\\\": 2483, \\\"com\\\": 2232, \\\"itv\\\": 1134, \\\"trv\\\": 2264, \\\".\\\": 2087, \\\"coc\\\": 1726, \\\"vft\\\": 2256, \\\"crc\\\": 264, \\\"dmp\\\": 1418, \\\"ad\\\": 1788, \\\"mod\\\": 295, \\\"spa\\\": 234, \\\"cn\\\": 575, \\\"suc\\\": 693, \\\"neg\\\": 685, \\\"add\\\": 545, \\\"br\\\": 783, \\\"on\\\": 51, \\\"idp\\\": 256, \\\"colv\\\": 133, \\\"rfp\\\": 100, \\\"cav\\\": 989, \\\"xx\\\": 22, \\\"adj\\\": 1067, \\\"abn\\\": 1489, \\\"3psm\\\": 1439, \\\"adt\\\": 663, \\\"vst\\\": 45, \\\"dtv\\\": 309, \\\"1ppg\\\": 537, \\\"cma\\\": 80, \\\"inp\\\": 158, \\\"clf\\\": 203, \\\"vpp\\\": 204, \\\"cln\\\": 241, \\\"pav\\\": 114, \\\"1psg\\\": 145, \\\"adf\\\": 8, \\\"mtn\\\": 75, \\\"vpt\\\": 1, \\\"2pg\\\": 26, \\\"3psg\\\": 72, \\\"rlp\\\": 8, \\\"im\\\": 12, \\\"2pm\\\": 2, \\\"2pf\\\": 1, \\\"adm\\\": 2, \\\"cmstn\\\": 1, \\\"tv\\\": 1, \\\"+423\\\": 1, \\\"1psm\\\": 1, \\\"ppn,\\\": 1, \\\"fppnr\\\": 1, \\\"ppnka\\\": 1}\", \"index_docs\": \"{\\\"17\\\": 1312, \\\"9\\\": 1895, \\\"8\\\": 1645, \\\"32\\\": 285, \\\"3\\\": 2542, \\\"16\\\": 1357, \\\"35\\\": 266, \\\"21\\\": 912, \\\"10\\\": 1271, \\\"5\\\": 2012, \\\"2\\\": 2535, \\\"1\\\": 2483, \\\"4\\\": 2232, \\\"19\\\": 1134, \\\"7\\\": 2264, \\\"15\\\": 2087, \\\"13\\\": 1726, \\\"6\\\": 2256, \\\"33\\\": 264, \\\"18\\\": 1418, \\\"12\\\": 1788, \\\"34\\\": 295, \\\"38\\\": 234, \\\"24\\\": 575, \\\"27\\\": 693, \\\"25\\\": 685, \\\"29\\\": 545, \\\"23\\\": 783, \\\"49\\\": 51, \\\"30\\\": 256, \\\"43\\\": 133, \\\"46\\\": 100, \\\"22\\\": 989, \\\"51\\\": 22, \\\"20\\\": 1067, \\\"14\\\": 1489, \\\"11\\\": 1439, \\\"26\\\": 663, \\\"48\\\": 45, \\\"31\\\": 309, \\\"28\\\": 537, \\\"47\\\": 80, \\\"42\\\": 158, \\\"37\\\": 203, \\\"39\\\": 204, \\\"36\\\": 241, \\\"44\\\": 114, \\\"40\\\": 145, \\\"54\\\": 8, \\\"45\\\": 75, \\\"58\\\": 1, \\\"50\\\": 26, \\\"41\\\": 72, \\\"53\\\": 8, \\\"52\\\": 12, \\\"56\\\": 2, \\\"59\\\": 1, \\\"55\\\": 2, \\\"60\\\": 1, \\\"61\\\": 1, \\\"62\\\": 1, \\\"63\\\": 1, \\\"57\\\": 1, \\\"65\\\": 1, \\\"64\\\": 1}\", \"index_word\": \"{\\\"1\\\": \\\"3psf\\\", \\\"2\\\": \\\"cmn\\\", \\\"3\\\": \\\"in\\\", \\\"4\\\": \\\"com\\\", \\\"5\\\": \\\"3ppg\\\", \\\"6\\\": \\\"vft\\\", \\\"7\\\": \\\"trv\\\", \\\"8\\\": \\\"ppn\\\", \\\"9\\\": \\\"sym\\\", \\\"10\\\": \\\"fr\\\", \\\"11\\\": \\\"3psm\\\", \\\"12\\\": \\\"ad\\\", \\\"13\\\": \\\"coc\\\", \\\"14\\\": \\\"abn\\\", \\\"15\\\": \\\".\\\", \\\"16\\\": \\\"co\\\", \\\"17\\\": \\\"pop\\\", \\\"18\\\": \\\"dmp\\\", \\\"19\\\": \\\"itv\\\", \\\"20\\\": \\\"adj\\\", \\\"21\\\": \\\"qnt\\\", \\\"22\\\": \\\"cav\\\", \\\"23\\\": \\\"br\\\", \\\"24\\\": \\\"cn\\\", \\\"25\\\": \\\"neg\\\", \\\"26\\\": \\\"adt\\\", \\\"27\\\": \\\"suc\\\", \\\"28\\\": \\\"1ppg\\\", \\\"29\\\": \\\"add\\\", \\\"30\\\": \\\"idp\\\", \\\"31\\\": \\\"dtv\\\", \\\"32\\\": \\\"adp\\\", \\\"33\\\": \\\"crc\\\", \\\"34\\\": \\\"mod\\\", \\\"35\\\": \\\"em\\\", \\\"36\\\": \\\"cln\\\", \\\"37\\\": \\\"clf\\\", \\\"38\\\": \\\"spa\\\", \\\"39\\\": \\\"vpp\\\", \\\"40\\\": \\\"1psg\\\", \\\"41\\\": \\\"3psg\\\", \\\"42\\\": \\\"inp\\\", \\\"43\\\": \\\"colv\\\", \\\"44\\\": \\\"pav\\\", \\\"45\\\": \\\"mtn\\\", \\\"46\\\": \\\"rfp\\\", \\\"47\\\": \\\"cma\\\", \\\"48\\\": \\\"vst\\\", \\\"49\\\": \\\"on\\\", \\\"50\\\": \\\"2pg\\\", \\\"51\\\": \\\"xx\\\", \\\"52\\\": \\\"im\\\", \\\"53\\\": \\\"rlp\\\", \\\"54\\\": \\\"adf\\\", \\\"55\\\": \\\"adm\\\", \\\"56\\\": \\\"2pm\\\", \\\"57\\\": \\\"ppn,\\\", \\\"58\\\": \\\"vpt\\\", \\\"59\\\": \\\"2pf\\\", \\\"60\\\": \\\"cmstn\\\", \\\"61\\\": \\\"tv\\\", \\\"62\\\": \\\"+423\\\", \\\"63\\\": \\\"1psm\\\", \\\"64\\\": \\\"ppnka\\\", \\\"65\\\": \\\"fppnr\\\"}\", \"word_index\": \"{\\\"3psf\\\": 1, \\\"cmn\\\": 2, \\\"in\\\": 3, \\\"com\\\": 4, \\\"3ppg\\\": 5, \\\"vft\\\": 6, \\\"trv\\\": 7, \\\"ppn\\\": 8, \\\"sym\\\": 9, \\\"fr\\\": 10, \\\"3psm\\\": 11, \\\"ad\\\": 12, \\\"coc\\\": 13, \\\"abn\\\": 14, \\\".\\\": 15, \\\"co\\\": 16, \\\"pop\\\": 17, \\\"dmp\\\": 18, \\\"itv\\\": 19, \\\"adj\\\": 20, \\\"qnt\\\": 21, \\\"cav\\\": 22, \\\"br\\\": 23, \\\"cn\\\": 24, \\\"neg\\\": 25, \\\"adt\\\": 26, \\\"suc\\\": 27, \\\"1ppg\\\": 28, \\\"add\\\": 29, \\\"idp\\\": 30, \\\"dtv\\\": 31, \\\"adp\\\": 32, \\\"crc\\\": 33, \\\"mod\\\": 34, \\\"em\\\": 35, \\\"cln\\\": 36, \\\"clf\\\": 37, \\\"spa\\\": 38, \\\"vpp\\\": 39, \\\"1psg\\\": 40, \\\"3psg\\\": 41, \\\"inp\\\": 42, \\\"colv\\\": 43, \\\"pav\\\": 44, \\\"mtn\\\": 45, \\\"rfp\\\": 46, \\\"cma\\\": 47, \\\"vst\\\": 48, \\\"on\\\": 49, \\\"2pg\\\": 50, \\\"xx\\\": 51, \\\"im\\\": 52, \\\"rlp\\\": 53, \\\"adf\\\": 54, \\\"adm\\\": 55, \\\"2pm\\\": 56, \\\"ppn,\\\": 57, \\\"vpt\\\": 58, \\\"2pf\\\": 59, \\\"cmstn\\\": 60, \\\"tv\\\": 61, \\\"+423\\\": 62, \\\"1psm\\\": 63, \\\"ppnka\\\": 64, \\\"fppnr\\\": 65, \\\"<pad>\\\": 0}\"}}"